[
  {
    "text": "Reminder to find little joys in ordinary moments. \n\nSo today, slow down. Feel it all. Be happy for no reason. \n\nGive this world all the love you have.",
    "engagement": 6018
  },
  {
    "text": "Recording every moment helps you relive the memories that matter \n\nIt reminds you how far you've come and what truly makes you happy. \n\nIn a fast world, these small moments are what stay with you. \n\nSo don't hesitate to capture them.",
    "engagement": 845
  },
  {
    "text": "I've always been fascinated by the human mind.\n\nWhat makes some people stay hungry for decades.\nWhat makes others burn out after one small win.\n\nEvery single high achiever I have met,\n\nFrom Sadhguru to Jay Shetty\nFrom Gaur Gopal Das to Kiran Bedi\nFrom Arnold Schwarzenegger to Gary Vaynerchuk\nFrom Jordan Peterson to Glenn Azar\nEven stories about Cristiano Ronaldo and Elon Musk\n\nThey think differently.\nThey feel differently.\nThey manage their minds differently.\n\nAnd at the center of it all is DOPAMINE.\n\nDopamine is not just about pleasure.\n\nIt is the chemical in your brain that decides what you chase\nWhat you crave\nAnd eventually\n\nWhat you become addicted to\nSocial media.\nGaming.\nConstant scrolling.\n\nWe're chasing the wrong highs.\nAnd losing our ability to go deep.\n\nTo stay present..\nTo be patient with long term goals..\n\nThis week, I finally released something I've been quietly building for years.\n\nA documentary on the science of dopamine.\nAnd how controlling it can quite literally change your life.\n\nIt's a summary of everything I've learned from the world's top performers.\n\nAnd a heartfelt guide for anyone who feels they've lost their drive\nTheir focus..\nOr their connection with themselves.\n\nInside it\nWe break down something I call the R E W I R E Protocol\n\nA step by step method to reset your mind\nAnd reprogram your relationship with pleasure\n\nThis is not about being productive all the time\n\nIt is about being in control again\nOf your energy\nYour focus\nYour ambition\n\nThis documentary is for the younger version of me\n\nThe one who didn't know how to stop\nWho didn't know why he felt low\nWho kept numbing his mind with noise\n\nIf you've ever felt stuck\nIf you've ever felt like your best self is slipping away\n\nThis is for you\n\nTake care of your brain\nIt is the home you live in forever\n\nKeep learning\nKeep growing",
    "engagement": 1107
  },
  {
    "text": "It's 10 years of my life.\n\nOf falling down, getting back up, and choosing not to quit.\n\nI've grown up in front of a camera.\n\nTen years ago, I was just a boy with a camera and a lot of confusion.\n\nI didn't know where it would lead.\nI didn't know who I would become.\n\nThere were moments I lost my way.\nThere were moments I lost people.\nThere were moments I almost lost myself.\n\nBut this journey gave me everything.\n\nIt gave me friendships.\nIt gave me lessons.\nIt gave me purpose.\n\nAnd most importantly, it gave me all of you.\n\nThere were times I wish I could go back and do things better, but maybe that's what this journey was meant to be.\n\nThis Diamond Play Button holds ten years of my life.\n\nIt holds the faces of the people I've worked with.\n\nThe tears I cried when no one was watching.\nThe little moments of joy that reminded me why I started.\n\nYou gave me the space to learn.\nYou gave me the love to keep going.\nYou gave me a reason to believe in second chances.\n\nTo the ones who reminded me that I could come back stronger.\n\nTo my team, to my family, to every single viewer,\nI don't have the right words but I feel this gratitude in every part of me.\n\nSo from the deepest corner of my heart, Thank you 🙏 \n\nFor every like.\nEvery comment.\nEvery message.\nEvery silent prayer you sent my way without even knowing it.\n\nAnd I promise you...\n\nThe best of it is still being written.\n\nWith love, Always.\n\nAlways onwards and upwards",
    "engagement": 18110
  },
  {
    "text": "Why do some people move forward in life… while others feel held back?\n\nI've asked myself this question many times in my career, in relationships, and during my toughest days.\n\nThe confusion. The emotional loops. The constant chasing of happiness without ever feeling settled.\n\nNeuroplasticity.\n\nIt's your brain's natural power to grow, heal, and change, at any age, and at any stage.\n\nMost of us are fighting too much and resting too little.\n\nEven when we think we're resting, we're still scrolling, worrying, comparing.\n\nWe're not taught how to regulate emotions.\n\nWe're not told how much our childhood still lives inside us.\n\nWe're definitely not told that our body holds emotions in our nervous system.\n\nBut we can learn.\n\nIf you've been waiting for a sign to dig deeper into your emotional and professional journey, this is it.\n\nIt's not just about dopamine or neurons. \nIt's about learning how to manage your inner chaos.",
    "engagement": 877
  },
  {
    "text": "“You forget how to love yourself. You look in the mirror… and only see what's missing.”\n\nI've been there.\n\nNot gonna lie—there was a time I felt this every morning.\n\nThere was always this silent voice inside saying, “It's not enough. You're not enough.”\n\nAnd that's the scary part about loneliness.\n\nWe're all chasing something—success, money, validation, the next big thing.\nBut somewhere in that hustle, we lose touch with ourselves.\n\nWe stop being kind to the person in the mirror.\n\nWe zoom into our flaws. We compare. We disconnect.\nAnd slowly… we forget how to be our own friend.\n\nBecause loneliness isn't about being alone.\n\nIt's about not feeling understood.\nNot being able to say what's really on your heart.\nNot knowing how to ask for help.\nAnd maybe that's where healing begins…\nNot by “fixing” ourselves—but by speaking to ourselves with kindness.\n\nWe created this for you — the 20-something chasing dreams, the 30-something feeling directionless, the 40-something wondering if it's too late…\n\nNo, it's not too late!\n\nBe kind to yourself.\nYou're not broken. You're becoming.",
    "engagement": 640
  },
  {
    "text": "11 things that (dedicated) men want to tell their partner, but often can't express :\n(boyfriends should share this with their girlfriends, saying 'caption is for you babe')\n\n1. Want to give you everything material, then everything emotional and then even more.\n2. You are my spiritual growth.\n3. If I knew that the crippling pain of my past led up to you, I'd drink it all up 10 times over just to land up at you once.\n4. Thank you for everything you do for me. Want you to feel the deep gratitude I have for you in every breath I take in your name.\n5. How do I serve you better? Thinking of building a flying carpet to take you around the planet, underneath the stars. Or maybe I'll just work hard enough to get us a whole star system & multiple private planets...\n6. I just wanna be better, for your future.\n7. I'll take care of your family even more than I'll take care of you.\n8. What you believe to be your flaws are ornaments in my eyes. I'm not with you for your looks, status or presentation skills. You just being you is more than I ever prayed for.\n9. Thank you for giving me your light to escape into.\n10. Life is tough but it used to be tough AND colourless until you arrived. Your presence is the colour in my monochrome world.\n11. You are what my 11:11s led up to",
    "engagement": 2981
  },
  {
    "text": "The illusion that people will treat you the way you treat them.\nThe illusion that honesty guarantees honesty in return.\nThe illusion that time will magically fix everything.\n\nNo one prepares you for the people who will betray you, the battles you'll have to fight alone, or the choices that will change everything.\n\nWe spend years figuring things out the hard way—through heartbreak, failures, and moments where nothing makes sense.\n\nAnd while experience is the best teacher, it's also the most expensive one.\n\nIf someone had told me these truths earlier, I could have saved myself a lot of pain.\n\nPain makes you stronger – The struggles you face today will help you tomorrow. Accept them.\nLiars can't be honest with you – If someone lies to themselves, don't expect truth from them.\nTearing others down won't make you better – Focus on your own growth, not on dragging others down.\nNot everyone deserves an explanation – Some people don't want to understand. Silence is your best answer.\nLiving only for weekends is a trap – Why suffer five days for just two days of happiness?\nDon't get hurt by people you don't respect – Their words mean nothing, so don't let them affect you.\nLife isn't tiring. Fear is. – Holding back, staying stuck, and avoiding change will drain you the most.\n\nLet go of expectations, protect your peace, and focus on becoming the best version of yourself.\n\nLighter. Clearer. Happier.",
    "engagement": 3219
  },
  {
    "text": "Accept people as they are.",
    "engagement": 2703
  },
  {
    "text": "Saying no isn't rude—it's necessary. \n\nYou don't have to please everyone or take on more than you can handle. \n\nProtect your time, set your limits, and focus on what truly matters. \n\nThe right people will respect your boundaries. The wrong ones will expose themselves. \n\nLearn to say no without guilt.",
    "engagement": 1213
  },
  {
    "text": "Exams feel stressful.\n\nWe've all been there—heart racing, palms sweating, the weight of expectations pressing down.\n\nBut here's something life taught me: stress isn't the enemy; it's training for everything that comes after.\n\nEven after building multiple businesses, I used to wake up from nightmares about failing an engineering exam.\n\nThat's how deeply exam pressure gets wired into us.\n\nBut over the years, I realized something—the real exams in life aren't the ones in classrooms.\n\nThey come in the form of career struggles, financial stress, and relationships.\n\nAnd guess what? If you learn to handle exam stress today, you'll be better prepared for life's biggest tests tomorrow.\nExams come and go, but the ability to stay strong under pressure stays with you forever.",
    "engagement": 2562
  },
  {
    "text": "Do it? Then own it.",
    "engagement": 2398
  },
  {
    "text": "Some things die much earlier—dreams, talents, skills, and time.\n\nAnd the worst part? We let it happen, often without even realizing it.\n\nMoney sitting idle loses its value.\n\nSkills we don't use start to fade.\n\nTime wasted never comes back.\n\nKnowledge we don't apply turns into a weight we carry.\n\nEven a machine left untouched will rust and fall apart.\n\nThe same happens to us....\n\nWhen we stop using our potential, we start losing it.\n\nWhen we stop challenging ourselves, we start becoming weaker.\n\nWhen we delay our dreams, they slowly slip away.\n\nLife isn't just about passing time. It's about making the most of what we have before it's too late.\n\nEvery skill, every opportunity, every moment—either you use it, or you lose it.\n\nSo don't let your energy, your ideas, your talent go to waste. Because the only thing worse than failure is never trying at all.",
    "engagement": 1751
  },
  {
    "text": "Better 100 rejections than one regret.",
    "engagement": 2390
  },
  {
    "text": "Nobody hands you confidence. Build it, own it, or stay invisible.",
    "engagement": 1431
  },
  {
    "text": "Fix your life first. Work won't save you.",
    "engagement": 3458
  },
  {
    "text": "Most people stay stuck, blaming luck, circumstances, or others.\n\nBut the truth is, growth comes down to mastering a few powerful skills.\n\nLearn them, use them, and watch how life starts working for you, not against you.",
    "engagement": 1328
  },
  {
    "text": "Some people spend their lives trying to be seen. Trying to market themselves. Trying to package their work in a way that gets attention.\n\nThey stress over what to post, how to stand out, how to stay relevant. But the ones who truly make it?\n\nThey don't try. They just live.\n\nThe best artists, the best entrepreneurs—they don't separate their work from their life.\n\nTheir work is who they are.\n\nThey don't have to think about content because their journey itself becomes the story.\n\nThey don't wake up wondering what to create today.\n\nThey wake up, chase their dreams, embrace the highs and lows, and the story writes itself.\n\nThat's why they never feel the need to \"switch off.\" Because there's nothing to switch off from.\n\nEvery experience—success, failure, joy, pain—becomes fuel for their craft.\n\nIt looks like they're doing a million things. Running businesses, creating content, building something new every day.\n\nBut deep down, they're just doing one thing—living fully inside their vision.\n\nThat's the real hack.\n\nWhen your story is the marketing, you don't chase success. You attract it.\n\nSo stop overthinking how to build a brand. Just live your truth. The world will notice.\n\n\"TURN YOUR LIFE INTO YOUR WORK—AND WATCH EVERYTHING CHANGE\"",
    "engagement": 635
  },
  {
    "text": "Sometimes agreement kills growth.",
    "engagement": 2690
  },
  {
    "text": "Everything changes—money, trends, even people. But what stays?\n\nThe value you bring. The way you think, adapt, and solve problems.\n\nThe ability to keep learning, to stay disciplined, to build real connections.\n\nThese are the things that will always serve you, no matter where life takes you.",
    "engagement": 1505
  },
  {
    "text": "Life doesn't send invitations for challenges. They just show up—unexpected, unplanned, and sometimes unbearable. Some people fight them. Some avoid them.\n\nMost people run from it.\n\nWhen a problem comes your way, do you panic, complain, or push it away?\n\nI've learned that growth isn't about having all the answers. It's about knowing when to push forward, when to step back, and when to just let things be.\n\nSuccess, peace, and growth don't come from luck. They come from understanding a few simple but powerful truths.\n\nFace challenges head-on – Avoiding problems only makes them worse. Face them, deal with them, and move on.\n\nSmall things steal big time – Losing your keys, searching for files, wasting time on distractions—it all adds up. When small things are messy, big things get delayed.\n\nCreate order in your daily life so you can focus on what actually moves you forward.\n\nThe fastest way to find purpose? Help someone. – When you feel stuck, stop thinking about yourself.\n\nGo do something for someone else. Giving value brings clarity and energy.\n\nNot everything needs fixing – A turtle climbs out of a river, struggling up a path. A woman “rescues” it and puts it back in the water—only to realize it had spent weeks climbing up to lay its eggs.\n\nBefore stepping in, ask yourself: Are you really helping, or just interfering?\n\nSubstance over style – People chase expensive cars, designer clothes, and fancy titles to look successful. But what is true power?\n\nIt comes from skills, knowledge, and action. Stop focusing on how success looks and start focusing on how it's built.\n\nYour body sets the limit – You can have the biggest dreams, but if you're always tired, sick, or low on energy, none of it matters.\n\nTake care of your body—because it's the one thing carrying you to your goals.\n\nStop avoiding. Stop overcomplicating. Stop focusing on things that don't matter.\n\nFace life. Organize the small. Give value. Observe before acting.\n\nChoose substance over show. Take care of yourself.\n\nThat's how you grow. That's how you win.",
    "engagement": 3189
  },
  {
    "text": "No one is coming to save you. No magic moment will change your life.\n\nTransformation is war. Not with the world, but with yourself.\n\nIt's about looking in the mirror and confronting the parts of yourself you'd rather ignore.\n\nIt's about breaking toxic patterns, killing old excuses, and choosing growth over comfort every single day.\n\nMost people wait for change. The wise ones bleed for it.",
    "engagement": 2132
  },
  {
    "text": "Ever felt frustrated because people don't act the way they should? Maybe they're rude, unreliable, or just straight-up annoying.\n\nYou try to fix them, correct them, or get angry at them—but what happens?\n\nNothing.\n\nIt's human tendency to that we want things to go our way. We want people to act the way we think is right. When they don't, we get frustrated.\n\nThey will be who they are. They will make mistakes. They will disappoint. That's their business.\n\nBut what about you? How do you respond? That's what really matters.\n\nIf someone is being difficult, let them. If someone is being unfair, let them.\n\nYou hold yourself to a higher standard. You control your emotions, your reactions, your energy.\n\nWeakness is letting others decide how you feel. Strength is choosing for yourself.\n\nAt the end of the day, you don't have time to fix others. You have enough work to do on yourself.\n\nKeep that focus, and life gets lighter.\n\nControl Yourself, Not Others.",
    "engagement": 6273
  },
  {
    "text": "Overthinking kills more dreams than failure ever will.",
    "engagement": 7248
  }
]
